import React from "react";
import './style.css'

let rules = [
    'Вибір товарів: Клієнт може переглядати асортимент товарів, ознайомлюватись з їх описом, характеристиками та цінами. Замовлення товарів здійснюється шляхом додавання їх до кошика.',
    'Оплата: Клієнт повинен обрати доступний спосіб оплати, такий як кредитна карта, електронний переказ або платіжні системи. Вартість товарів та вартість доставки, якщо така є, зазвичай будуть вказані перед підтвердженням замовлення.',
    'Доставка: Магазин надає інформацію про умови доставки, такі як терміни, вартість та доступні способи доставки. Клієнт повинен забезпечити достовірну адресу доставки та зрозуміти, що деякі обмеження можуть бути застосовані для деяких товарів або регіонів.',
    'Повернення і обмін: Умови повернення або обміну товарів можуть бути зазначені на веб-сайті магазину. Клієнт повинен ознайомитись з цими умовами та звернутись до магазину у разі потреби повернення або обміну товару.',
    "Конфіденційність: Магазин зобов'язується захищати конфіденційність особистої інформації клієнтів та дотримуватись вимог законодавства про захист персональних даних."
]

export default function Rules(){
    return(
        <div className="rules-page">
            <h2>Правила</h2>
            <ul>
                {rules.map(item => <li>{item}</li>)}
            </ul>
        </div>
    )
}